# DeletingCurtainSystemFaceGridLines Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..DeletingCurtainSystemFaceGridLines Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Deleting Grid Lines residing on faces that no longer are part of a Curtain System.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DeletingCurtainSystemFaceGridLines { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeletingCurtainSystemFaceGridLines As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DeletingCurtainSystemFaceGridLines {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace